# GetClTextureL

## Description
Function GetClTextureL returns the left side wall texture of the specified class.

```pascal
FUNCTION GetClTextureL(className : STRING): LONGINT;
```

```python
def vs.GetClTextureL(className):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Class name.|

## Remarks
Returns the wall left texture of the class named className.

## Version
Availability: from VectorWorks8.0

## Category
* Textures